<a href="https://colab.research.google.com/github/Mohamed-Willy/ML-Course/blob/R/ML_1_DataPreprocessing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>


# **Importing data set**

In [ ]:
# Data Preprocessing Template

# Importing the dataset
dataset = read.csv('/content/Data.csv')

#Showing data
dataset

   Country Age Salary Purchased
1  France  44  72000  No
2  Spain   27  48000  Yes
3  Germany 30  54000  No
4  Spain   38  61000  No
5  Germany 40     NA  Yes
6  France  35  58000  Yes
7  Spain   NA  52000  No
8  France  48  79000  Yes
9  Germany 50  83000  No
10 France  37  67000  Yes

#**Missing data**

In [ ]:
#is.na() is used to deal with missing values in the dataset or data frame

#to remove NA values from the vector use na. rm() or is.na() functions

#'''''''''''''''''
#  strategy in missing data:
#    ignore row
#    mean
#''''''''''''''''''

dataset$Age = ifelse(is.na(dataset$Age),
                     ave(dataset$Age, FUN = function(x) mean(x,na.rm=TRUE)),
                     dataset$Age)

dataset$Salary = ifelse(is.na(dataset$Salary),
                        ave(dataset$Salary, FUN = function(x) mean(x,na.rm=TRUE)),
                        dataset$Salary)
dataset

   Country Age      Salary   Purchased
1  France  44.00000 72000.00 No
2  Spain   27.00000 48000.00 Yes
3  Germany 30.00000 54000.00 No
4  Spain   38.00000 61000.00 No
5  Germany 40.00000 63777.78 Yes
6  France  35.00000 58000.00 Yes
7  Spain   38.77778 52000.00 No
8  France  48.00000 79000.00 Yes
9  Germany 50.00000 83000.00 No
10 France  37.00000 67000.00 Yes

#**Encoding categorical data**

In [ ]:
#factor(x,levels,labels)
#x -> a vector of data, usually taking a small number of distinct values.
#levels	-> an optional vector of the unique values (as character strings) that x might have taken.
#The default is the unique set of values taken by as.character(x), sorted into increasing order of x.
#Note that this set can be specified as smaller than sort(unique(x)).
#labels	-> either an optional character vector of labels for the levels (in the same order as levels after removing those in exclude),
#or a character string of length 1. Duplicated values in labels can be used to map different values of x to the same factor level.

dataset$Country = factor(dataset$Country,
                         levels = c('France','Germany','Spain'),
                         labels = c('0','1','2'))

dataset$Purchased = factor(dataset$Purchased,
                           levels = c('Yes','No'),
                           labels = c('1','0'))

dataset

   Country Age      Salary   Purchased
1  0       44.00000 72000.00 0
2  2       27.00000 48000.00 1
3  1       30.00000 54000.00 0
4  2       38.00000 61000.00 0
5  1       40.00000 63777.78 1
6  0       35.00000 58000.00 1
7  2       38.77778 52000.00 0
8  0       48.00000 79000.00 1
9  1       50.00000 83000.00 0
10 0       37.00000 67000.00 1

#**Splitting data set**

In [ ]:
# Importing packages
install.packages('caTools')
library(caTools)

# The set.seed() function in R is used to create reproducible results when writing code
# that involves creating variables that take on random values.

# By using the set.seed() function, you guarantee that the same random values are produced each time you run the code.
set.seed(123)

# The split function allows dividing data in groups based on factor levels.
# split(x,SplitRatio)
# x -> data frame
# SplitRatio -> true values
# we apply split on dependent variable
split = sample.split(dataset$Purchased,SplitRatio = 0.8)

training_set=subset(dataset,split==TRUE)
testing_set = subset(dataset,split==FALSE)

training_set
testing_set

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

   Country Age      Salary   Purchased
1  0       44.00000 72000.00 0
2  2       27.00000 48000.00 1
3  1       30.00000 54000.00 0
4  2       38.00000 61000.00 0
5  1       40.00000 63777.78 1
7  2       38.77778 52000.00 0
8  0       48.00000 79000.00 1
10 0       37.00000 67000.00 1

  Country Age Salary Purchased
6 0       35  58000  1
9 1       50  83000  0

#**Feature Scalling**

In [ ]:
training_set[,2:3]=scale(training_set[2:3])
testing_set[2:3]=scale(testing_set[2:3])

training_set
testing_set

   Country Age         Salary     Purchased
1  0        0.90101716  0.9392746 0
2  2       -1.58847494 -1.3371160 1
3  1       -1.14915281 -0.7680183 0
4  2        0.02237289 -0.1040711 0
5  1        0.31525431  0.1594000 1
7  2        0.13627122 -0.9577176 0
8  0        1.48678000  1.6032218 1
10 0       -0.12406783  0.4650265 1

  Country Age        Salary     Purchased
6 0       -0.7071068 -0.7071068 1
9 1        0.7071068  0.7071068 0